In [2]:
import numpy as np
import pandas as pd
import sys
import csv
import re

# Data loading, storage, formats

## Reading and Writing Data in Text Format

#### functions for reading tabular data as a DataFrame object: Python for Data Analysis, page 167

### read_csv()

In [2]:
!type example1.csv                            # !type

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

example1.csv


ЌҐ г¤ Ґвбп ­ ©вЁ гЄ § ­­л© д ©«.
ЋиЁЎЄ  ў® ўаҐ¬п ®Ўа Ў®вЄЁ: #.
ЌҐ г¤ Ґвбп ­ ©вЁ гЄ § ­­л© д ©«.
ЋиЁЎЄ  ў® ўаҐ¬п ®Ўа Ў®вЄЁ: !type.

In [3]:
df = pd.read_csv("example1.csv")

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
!type example2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
pd.read_csv("example2.csv", header=None)                           # pd.read_csv(header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv("example2.csv", names = ['a','b','c','d','message'])   # pd.read_csv(names = [])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
names = ['a','b','c','d','message']
pd.read_csv('example2.csv', names=names, index_col='message')      # pd.read_csv(index_col = '')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [9]:
!type example3.csv

# hey!
a,b,c,d,message
1,2,3,4,hello
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
5,6,7,8,world
9,10,11,12,foo

In [10]:
pd.read_csv('example3.csv', skiprows=[0,3,4])                      # pd.read_csv(skiprows=[])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
!type example4.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [12]:
pd.read_csv('example4.csv')

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [13]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv('example4.csv', na_values=sentinels)                    # pd.read_csv(na_values = .....)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

#### Some read_csv/read_table function arguments: Python for Data Analysis, page 172

### Reading Text Files in Pieces(n_rows = , chunksize = )

#### Python for Data Analysis, page 167

### Writing Data to Text Format

In [14]:
data = pd.read_csv('example4.csv')

In [15]:
data.to_csv('out.csv')                           # df.to_csv(path) (works for series as well)

In [16]:
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [17]:
data.to_csv(sys.stdout, sep = '|')               # writing to sys.stdout so it prints the text 
                                                 # result to the console

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [18]:
# df.to_csv(na_rep = '') : denotes missing values('NULL' or 'NA' by default)
data.to_csv(sys.stdout, na_rep='NA')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NA
1,two,5,6,NA,8,world
2,three,9,10,11.0,12,foo

In [19]:
data.to_csv(sys.stdout, index=False, header=False) # index=False, header = False: disables saving indexes and cols

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [20]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c']) # columns = [] : only subset of cols

a,b,c
1,2,3.0
5,6,
9,10,11.0

### Working with Delimited Formats

#### Python for Data Analysis, page 176

### JSON Data

#### Python for Data Analysis, page 178

### XML and HTML: Web Scraping

#### Python for Data Analysis, page 180

## Binary Data Formats

### Using HDF5 Format

In [21]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [22]:
store = pd.HDFStore('mydata.h5')

In [23]:
store['obj1'] = frame

In [24]:
store['obj1_col'] = frame['a']

In [25]:
store['obj1']

           a
0   1.686464
1  -1.192025
2  -1.099274
3   0.970919
4  -2.128140
..       ...
95 -0.788776
96  0.360798
97 -2.503488
98  1.342534
99 -0.423011

[100 rows x 1 columns]

In [26]:
store.put('obj2', frame, format='table')

In [27]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -0.250173
11 -1.261924
12  0.437915
13 -0.444047
14 -0.749145
15 -1.641604

In [28]:
store.close()

In [29]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [30]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  1.686464
1 -1.192025
2 -1.099274
3  0.970919
4 -2.128140

### Reading Microsoft Excel Files

#### Python for Data Analysis, page 186

# Data cleaning and preparation

## Filtering Out Missing Data

In [31]:
from numpy import nan as NA

In [32]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [33]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [34]:
data[3] = NA
data

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [35]:
data.dropna(axis=1, how='all')                            # df.dropna(axis = ..., how = '...', thresh = ...)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [36]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  1.007052       NaN       NaN
1 -0.343710       NaN       NaN
2 -0.113331       NaN  0.569344
3 -1.309848       NaN -1.467968
4  1.598361  0.749875 -0.107900
5 -0.280367 -0.082174 -0.622419
6 -1.061123  0.863504  1.139752

In [37]:
df.dropna(thresh=2)

          0         1         2
2 -0.113331       NaN  0.569344
3 -1.309848       NaN -1.467968
4  1.598361  0.749875 -0.107900
5 -0.280367 -0.082174 -0.622419
6 -1.061123  0.863504  1.139752

## Filling In Missing Data

In [38]:
df.fillna(0)

          0         1         2
0  1.007052  0.000000  0.000000
1 -0.343710  0.000000  0.000000
2 -0.113331  0.000000  0.569344
3 -1.309848  0.000000 -1.467968
4  1.598361  0.749875 -0.107900
5 -0.280367 -0.082174 -0.622419
6 -1.061123  0.863504  1.139752

In [39]:
df.fillna({1:3, 2:1}, inplace=True)                 # df.fillna(inplace=..., method='', limit=...)

In [40]:
df

          0         1         2
0  1.007052  3.000000  1.000000
1 -0.343710  3.000000  1.000000
2 -0.113331  3.000000  0.569344
3 -1.309848  3.000000 -1.467968
4  1.598361  0.749875 -0.107900
5 -0.280367 -0.082174 -0.622419
6 -1.061123  0.863504  1.139752

In [41]:
df2 = pd.DataFrame(np.random.randn(5,3))

In [42]:
df2.iloc[2:, 1] = NA
df2

          0         1         2
0 -0.173880  1.114957 -0.292475
1  0.480285 -1.922967  0.224358
2 -0.215819       NaN -0.495738
3 -1.855620       NaN  1.095214
4 -0.928709       NaN -0.374075

In [43]:
df2.fillna(method='ffill')

          0         1         2
0 -0.173880  1.114957 -0.292475
1  0.480285 -1.922967  0.224358
2 -0.215819 -1.922967 -0.495738
3 -1.855620 -1.922967  1.095214
4 -0.928709 -1.922967 -0.374075

In [44]:
df2.fillna(method='ffill', limit=2)

          0         1         2
0 -0.173880  1.114957 -0.292475
1  0.480285 -1.922967  0.224358
2 -0.215819 -1.922967 -0.495738
3 -1.855620 -1.922967  1.095214
4 -0.928709       NaN -0.374075

In [45]:
df3 = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})
df3

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [46]:
df3.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [47]:
df3.drop_duplicates()                                   # df.drop_duplicates(keep='')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [48]:
df3.drop_duplicates('k1')

    k1  k2
0  one   1
1  two   1

In [49]:
df3.drop_duplicates(keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

## Transforming Data Using a Function or Mapping

In [50]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [51]:
meat_to_animal = {'bacon': 'pig', 'pulled pork': 'pig','pastrami': 'cow',
                  'corned beef': 'cow',
                  'honey ham': 'pig',
                  'nova lox': 'salmon'}

In [52]:
lowercased = data['food'].str.lower()

In [53]:
data['animal'] = lowercased.map(meat_to_animal)

In [54]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

## Replacing Values

In [55]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [56]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [57]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [58]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [59]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [60]:
transform = lambda x: x[:4].upper()

In [61]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [62]:
data.rename(index=str.title, columns=str.upper)              # df.rename()

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

## Discretization and Binning

In [63]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [64]:
bins = [18, 25, 35, 60, 100]

In [65]:
cats = pd.cut(ages, bins)                                   # pd.cut(right = True/False, labels=[], precision = )

In [66]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [67]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [68]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [69]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [70]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [71]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [72]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [73]:
data = np.random.rand(20)

In [74]:
par = pd.cut(data, 4, precision=2)
par

[(0.22, 0.42], (0.22, 0.42], (0.019, 0.22], (0.019, 0.22], (0.22, 0.42], ..., (0.62, 0.82], (0.019, 0.22], (0.62, 0.82], (0.22, 0.42], (0.62, 0.82]]
Length: 20
Categories (4, interval[float64]): [(0.019, 0.22] < (0.22, 0.42] < (0.42, 0.62] < (0.62, 0.82]]

In [75]:
par.categories

IntervalIndex([(0.019, 0.22], (0.22, 0.42], (0.42, 0.62], (0.62, 0.82]],
              closed='right',
              dtype='interval[float64]')

In [76]:
data2 = np.random.randn(1000)

A closely related function, qcut, bins the data based on sample quantiles. Depending
on the distribution of the data, using cut will not usually result in each bin having the
same number of data points. Since qcut uses sample quantiles instead, by definition
you will obtain roughly equal-size bins

In [77]:
cats2 = pd.qcut(data2, 4)                                 # pd.qcut()

In [78]:
cats2

[(-3.239, -0.641], (-0.641, 0.0326], (-0.641, 0.0326], (-0.641, 0.0326], (0.0326, 0.647], ..., (-3.239, -0.641], (0.647, 3.438], (0.647, 3.438], (0.0326, 0.647], (0.0326, 0.647]]
Length: 1000
Categories (4, interval[float64]): [(-3.239, -0.641] < (-0.641, 0.0326] < (0.0326, 0.647] < (0.647, 3.438]]

In [79]:
pd.value_counts(cats2)

(0.647, 3.438]      250
(0.0326, 0.647]     250
(-0.641, 0.0326]    250
(-3.239, -0.641]    250
dtype: int64

passing your own quantiles (numbers between 0 and 1, inclusive)

In [80]:
cats3 = pd.qcut(data2, [0, 0.1, 0.5, 0.9, 1.])
cats3

[(-3.239, -1.323], (-1.323, 0.0326], (-1.323, 0.0326], (-1.323, 0.0326], (0.0326, 1.278], ..., (-1.323, 0.0326], (0.0326, 1.278], (0.0326, 1.278], (0.0326, 1.278], (0.0326, 1.278]]
Length: 1000
Categories (4, interval[float64]): [(-3.239, -1.323] < (-1.323, 0.0326] < (0.0326, 1.278] < (1.278, 3.438]]

In [81]:
pd.value_counts(cats3)

(0.0326, 1.278]     400
(-1.323, 0.0326]    400
(1.278, 3.438]      100
(-3.239, -1.323]    100
dtype: int64

## Detecting and Filtering Outliers

In [82]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.002936     0.049199     0.029629    -0.012053
std       1.002231     1.006516     1.002116     1.061214
min      -3.370666    -3.227078    -2.746140    -3.229878
25%      -0.653765    -0.649668    -0.691773    -0.763870
50%       0.009393     0.071552     0.063728     0.009245
75%       0.652960     0.719741     0.684684     0.725125
max       3.285722     3.908045     3.619793     3.418960

In [83]:
col = data[2]

In [84]:
col[np.abs(col)>3]

70     3.059472
607    3.050365
984    3.619793
Name: 2, dtype: float64

In [85]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
70  -0.286550 -0.235600  3.059472 -0.243999
85  -3.236222  0.795586  0.180946 -1.860828
585 -0.033335  0.452709  1.058947  3.373255
587  0.659788  0.015611 -0.495843  3.418960
607  0.702589 -0.432661  3.050365  0.675748
615 -3.370666 -0.425111 -1.071468  0.570662
671  1.441211 -1.459363 -0.997769 -3.229878
692  3.078104 -2.291283 -0.401873 -0.358243
747  0.392185  3.908045 -0.009092  0.289726
791  2.197284 -3.227078  0.314084 -1.440527
907  0.796545  0.336828  0.089373  3.319358
981  3.285722 -0.207722  1.028438  0.132574
984  0.447977 -1.421393  3.619793  0.894039

In [86]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1  1.0 -1.0 -1.0  1.0
2  1.0 -1.0  1.0  1.0
3  1.0 -1.0 -1.0  1.0
4  1.0 -1.0 -1.0 -1.0

In [87]:
data[np.abs(data) > 3] = np.sign(data) * 3                      # np.sign()
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.003179     0.048518     0.028900    -0.012935
std       0.999177     1.002720     0.999754     1.057179
min      -3.000000    -3.000000    -2.746140    -3.000000
25%      -0.653765    -0.649668    -0.691773    -0.763870
50%       0.009393     0.071552     0.063728     0.009245
75%       0.652960     0.719741     0.684684     0.725125
max       3.000000     3.000000     3.000000     3.000000

## Permutation and Random Sampling

In [88]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [89]:
sampler = np.random.permutation(5)                        # np.random.permutation()
sampler

array([4, 3, 1, 0, 2])

In [90]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

That array can then be used in iloc-based indexing or the equivalent take function

In [91]:
df.take(sampler)                                                # df.take()

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11

In [92]:
df.sample(n=3)                        # df.sample(replace = True/False): 
                                      # returns random subset of n rows

   0  1   2   3
0  0  1   2   3
2  8  9  10  11
1  4  5   6   7

In [93]:
choices = pd.Series([5, 7, -1, 6, 4])

In [94]:
draws = choices.sample(n=10, replace=True)

In [95]:
draws

4    4
4    4
4    4
3    6
2   -1
3    6
1    7
0    5
3    6
0    5
dtype: int64

## Computing Indicator/Dummy Variables

In [96]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [97]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [98]:
pd.get_dummies(df['key'])                         # pd.get_dummies(prefix = '...')

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [99]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [100]:
df_with_dummy = df[['data1']].join(dummies)                #df1.join(df2)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [101]:
mnames = ['movie_id', 'title', 'genres']

In [102]:
movies = pd.read_table('C:/Users/kuryz/Desktop/Machine_Learning/Books/datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)

C:\Users\kuryz\miniconda3\lib\site-packages\pandas\io\parsers.py:765: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  return read_csv(**locals())

In [103]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [104]:
all_genres = []

In [105]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [106]:
genres = pd.unique(all_genres)

In [107]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [108]:
zero_matrix = np.zeros((len(movies), len(genres)))
zero_matrix

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [109]:
dummies = pd.DataFrame(zero_matrix, columns=genres)
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [110]:
gen = movies.genres[0]

In [111]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [112]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [113]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [114]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [115]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))        # df.add_prefix('...')

In [116]:
movies_windic

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",Drama|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [117]:
values = np.random.rand(10)

In [118]:
values

array([0.10667651, 0.85704976, 0.62890544, 0.52400509, 0.54639187,
       0.29583687, 0.44639424, 0.77921349, 0.0150447 , 0.11257753])

In [119]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [120]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           1           0           0           0           0
1           0           0           0           0           1
2           0           0           0           1           0
3           0           0           1           0           0
4           0           0           1           0           0
5           0           1           0           0           0
6           0           0           1           0           0
7           0           0           0           1           0
8           1           0           0           0           0
9           1           0           0           0           0

## String Manipulation

## String Object Methods

In [121]:
val = 'a,b, guido'

In [122]:
val.split(',')                                        #str.split('...')

['a', 'b', ' guido']

In [123]:
pieces = [x.strip() for x in val.split(',')]          #str.strip()
pieces

['a', 'b', 'guido']

In [124]:
'::'.join(pieces)                                     #.join()

'a::b::guido'

In [125]:
val.index(',')                                        #str.index('...')

1

In [126]:
val.find(':')                                         #str.find('...')  (does not raise an exception if no value)

-1

#### Python built-in string methods:  Python for Data Analysis, page 213

## Regular Expressions

In [127]:
text = "foo bar\t baz \tqux"

In [128]:
re.split('\s+', text)                                 # re.split('...', text)

['foo', 'bar', 'baz', 'qux']

In [129]:
regex = re.compile('\s+')                             # re.compile('...')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [130]:
regex.findall(text)                                   # .findall()

[' ', '\t ', ' \t']

In [131]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [132]:
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [133]:
m = regex.search(text)                                # .searc(text)  :  finds first match only

In [134]:
text[m.start():m.end()]

'dave@google.com'

regex.match returns None, as it only will match if the pattern occurs at the start of the
string

In [135]:
print(regex.match(text))                              # .match(text)

None

In [136]:
print(regex.sub('REDACTED', text))                    # .sub('...', text)

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

parentheses around the parts of the pattern to segment

In [137]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [138]:
m = regex.match('wesm@bright.net')

In [139]:
 m.groups()                                            # .groups() attribute

('wesm', 'bright', 'net')

In [140]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

sub also has access to groups in each match using special symbols like \1 and \2. The
symbol \1 corresponds to the first matched group, \2 corresponds to the second, and
so forth

In [141]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

#### Regular expression methods: Python for Data Analysis, page 216

## Vectorized String Functions in pandas

In [142]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [143]:
data.str.contains('gmail')                               # dat.str.contains('...') : only for Series

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [144]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [145]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [146]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [147]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

#### Partial listing of vectorized string methods: Python for Data Analysis, page 218